{
  "Fish_sub": [
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101251394_main?_a=AJAH1WI0",
      "title": "13 Fishing Concept A2 Baitcase Reel",
      "offer": false,
      "brand": "13 Fishing",
      "price": 180.0,
      "rating": 2,
      "description": "Small fish need not apply. The 13 Fishing® Concept A2 Baitcast Reel is all about putting heavyweights in the well, day in and day out! This advanced 2nd generation reel is tough as nails and loaded with unique and patented features. Its ultra-low profile, palm-fitting design holds 25% more line, yet has the same compact footprint as earlier models; the High-Density Aluminum frame is strong and rigid, and houses H.A.M. (Hard as a Mother) precision-cut Japanese brass gearing for amazing strength and smoothness. Concept A2 innovation is a recurring theme, with its protective Water Channeling Body Design, easy-to-adjust incremental Low-Friction Braking, spring-loaded Beetle Wing Rapid Access sideplate, and cast-enhancing Arrowhead Line Guide. The quality 6+1 system features stainless steel ball bearings that are chemically plated for extra corrosion resistance, plus rock-solid Dead Stop anti-reverse with slotted, rail-supported clutch cam. 13 Fishing's Bulldog Carbon Drag incorporates 6 oversized carbon drag discs for up to 25 lbs. of stopping power; equipped with a replaceable KeepR Integrated Hook Keeper. For utmost performance and reliability, this is the reel that can stand up to the rigors of tournament fishing."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101251395_main?_a=AJAH1WI0",
      "title": "13 Fishing Concept C2 Baitcase Reel",
      "offer": false,
      "brand": "13 Fishing",
      "price": 230.0,
      "rating": 3,
      "description": "Exceptionally light in weight, but heavy on game-changing features, the 13 Fishing® Concept C2 Baitcast Reel is all about tournament-grade efficiency! This advanced 2nd generation reel weighs well under 6 oz. and is built for all-day, every-day casting and catching. The C2's rigid, lightweight Cast Iron Carbon frame material is stronger than aluminum and takes corrosion completely out of the picture, while its Hamai-cut, Ti-Armor Aluminum drive gear offers triple the resistance to environmental corrosion, for butter-smooth operation at all times. This reel is loaded with innovative performance features, including an exclusive High Spin Spool System for added casting distance, easy-to-adjust incremental Low-Friction Braking, spring-loaded Beetle Wing Rapid Access sideplate, and cast-enhancing Arrowhead Line Guide. The quality 8+1 ball-bearing system features a pair of High Spin corrosion-resistant Japanese spool bearings, stainless steel system bearings, and a Dead Stop anti-reverse bearing with reinforced clutch cam. 13 Fishing's Bulldog Carbon Drag incorporates 6 oversized carbon drag discs for up to 25 lbs. of stopping power; equipped with a replaceable KeepR Integrated Hook Keeper. Fish the Concept C2 a few times, and you'll find yourself consistently re-tying instead of reaching for another outfit! Trick Shop compatible."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101254372_main?_a=AJAH1WI0",
      "title": "13 Fishing Concept Z Slide Baitcase Reel",
      "offer": false,
      "brand": "13 Fishing",
      "price": 275.0,
      "rating": 1,
      "description": "See what all the buzz is about! The 13 Fishing® Concept Z Slide Baitcast Reel pushes the edge of design, engineering, and materials forward. The original Concept Z rocked the industry with its groundbreaking CZB technology, and as you'll see, this Gen II version doesn't disappoint. It starts with the innovative SLIDE magnetic cast control system, located in the perfect place for anglers to adjust without missing a single cast. With SLIDE, you can control casting downwind and then upwind on alternating casts with a flick of the thumb. Pitch, flip, or just let it fly by combining or isolating the Low-Friction Centrifugal braking with the magnetic SLIDE braking—it's a whole new approach, there at your fingertips. With its rock-solid Cast-Iron Carbon frame and sideplates, quality 7-bearing system with Zero-Corrosion CZB ball bearings, and 13 Fishing's Advanced Polymer Drag system, this design aggressively raises the bar for material innovation."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/151/master1_101254371_main?_a=AJAH1WI0",
      "title": "13 Fishing Concept TX2 Baitcase Reel",
      "offer": true,
      "brand": "13 Fishing",
      "price": 300.0,
      "orig": 400,
      "rating": 4,
      "description": "Continuing its bloodline of being the most durable saltwater low-profile baitcasting platform, the 13 Fishing® Concept TX2 Baitcast Reel is ready to pit its Gen II technology against trophy reds and snook in the harshest environment you can find. The new Zero-Corrosion Cast-Iron Carbon chassis houses 13 Fishing's BOSS H.A.M. hardened brass precision-cut main gear, and its quality 10-bearing system matches Black Seal Hyper Corrosion-Resistant ball bearings with Zero-Corrosion High-Speed CZB composite spool bearings to deliver peak performance and longevity all around. The exciting Advanced Polymer Drag will easily withstand all the abuse any angler (or fish) can apply. The new standard in the salt has arrived, and its integrated drag alarm is ready to alert you when the battle is on!"
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101254373_main?_a=AJAH1WI0",
      "title": "13 Fishing Concept A3 Baitcase Reel",
      "offer": false,
      "brand": "13 Fishing",
      "price": 250.0,
      "rating": 3,
      "description": "The 13 Fishing® Concept A3 Baitcast Reel, with its rugged HD aluminum construction and Ocean Armor 2 saltwater protection, is the perfect choice for targeting Pacific Coast calicos, giant musky, double-digit bass, or Gulf Coast inshore monsters. Simply put, it has everything you want in a big, low-profile reel. Drag and power represent the primary focal points of the enhanced A3 design, with H.A.M. hardened brass gearing cut with Japanese Hamai precision serving as the engine that drives the machine. Premium 7-bearing system with instant anti-reverse; incredible 40-lb. Carbon Bull Drag, with all the stopping power you'll need to land your trophy."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_100855190_main?_a=AJAH1WI0",
      "title": "Ardent Summit Hawk Casting Reel",
      "offer": false,
      "brand": "Ardent",
      "price": 229.0,
      "rating": 4,
      "description": "3 years in development, the Ardent Summit Hawk Casting Reel represents a new platform in Ardent's low-profile baitcast lineup. Specifically targeted toward tournament bass fishing, this eye-catching reel will turn heads everywhere. Its lightweight, high-strength aluminum frame features a unique striated finish with an oversized gear box that delivers both cranking power and high retrieve ratios; the deep-V machined, double-anodized 6061 T6 aluminum spool and 270° Magnetic Brake System combine to deliver smooth casting at any distance. Butter-smooth 10+1 bearing system; premium StrikeSaver Drag; swept-back aluminum drag star and handle with EVA grips. Manufacturer's 3-year warranty"
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_2291262_main?_a=AJAH1WI0",
      "title": "Ardent Apex Tournament Baitcase Reel",
      "offer": true,
      "brand": "Ardent",
      "orig": 300,
      "price": 119.99,
      "rating": 2,
      "description": "Not every competitive angler can load a casting deck with $400 reels. Those who seek high performance without the high price tag will find a great casting partner in the Ardent Apex Tournament Baitcast Reel. Priced under $100, the Apex Tournament brings the pro-level features Ardent reels are known for, to help you get the most out of your time on the water. The feature list includes Ardent's super-lightweight, high-strength aluminum frame; deep V6061 T6 machined aluminum spool; and a quality 8+1 ball-bearing system complemented by an externally adjustable 270º Mag brake. Extra details such as an extra-long, swept-back aluminum handle and swept-back forged aluminum drag star enhance the compact footprint of this well-designed reel, for great handling at the point of attack. Versatile 6.5:1 gear ratio."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_2291252_main?_a=AJAH1WI0",
      "title": "Ardent Apex Grand Baitcase Reel",
      "offer": false,
      "brand": "Ardent",
      "price": 229.99,
      "rating": 3,
      "description": "Anglers looking for a performance edge will find it in the Ardent Apex Grand Baitcast Reel. Its selection of gear ratios offers the versatility needed to tackle any technique, and the dual braking system applies a level of casting precision not found in other reels. Extremely light in weight, the Apex Grand is built on a high-strength aluminum frame that houses a stellar 12+1 ball-bearing system for top-level smoothness in all functions. The combination of Ardent's deep V6061 T6 machined aluminum spool, internally adjustable centrifugal braking, and externally adjustable 270° Magnetic Brake System gives you the ability to prevail even in the roughest weather. Extra-long, swept-back carbon fiber handle with EVA grips for maximum cranking power; swept-back forged aluminum drag star. Mfrs. full 3-year warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_2291985_main?_a=AJAH1WI0",
      "title": "Ardent Apex Magnum Baitcast Reel",
      "offer": false,
      "brand": "Ardent",
      "price": 179.0,
      "rating": 4,
      "description": "With its huge line capacity, superior cranking power, and beefed-up drag system, this crossover reel is perfect for heavy-duty work in fresh- or saltwater. Bass and musky fishermen will find the Ardent Apex Magnum Baitcast Reel outstanding for distance casting with high-resistance lures, while inshore anglers will appreciate its bulldog-like run-stopping power. This reel's wide-body design features a rugged cast-aluminum frame and spool, backed by a smooth 10+1 ball-bearing system with externally adjustable 270-degree Mag brake. To enhance its fighting ability, Ardent has augmented this reel's powerful 17.6-lb. drag system with its patent-pending Drag Tracking Technology, which eliminates sharp angles through the line guide and allows the line to flow directly onto the spool while under load, for maximum straight-on power and line protection. And the extra-long, swept-back carbon fiber handle adds another layer of control when battling large, hard-charging fish. Gear ratio: 6.5:1."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_2291255_main?_a=AJAH1WI0",
      "title": "Ardent Apex Elite Baitcast Reel",
      "offer": false,
      "brand": "Ardent",
      "price": 179.99,
      "rating": 3,
      "description": "Superior castability, butter-smooth handling, and gear ratios suited for control techniques make the 5.9-ounce Ardent Apex Elite Baitcast Reel a must-have for the serious angler. Built on Ardent's classic high-strength aluminum frame and equipped with a high-performance, deep V6061 T6 machined aluminum spool, the Apex Elite utilizes a 12+1 ball-bearing system to deliver hindrance-free casting and smooth, effortless retrieves. The externally adjustable 270-degree Mag brake system helps you combat unfavorable winds at the touch of a finger. Extra-long, swept-back carbon fiber handle with comfortable EVA grips; low-profile, swept-back forged aluminum drag star. Weight: 5.9 oz."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101327699_main?_a=AJAH1WI0",
      "title": "New! Bates Fishing Rosa Baitcast Reel",
      "offer": false,
      "brand": "Bates Fishing",
      "price": 299.99,
      "rating": 2,
      "description": "Bates Fishing Rosa Baitcast Reel works as tirelessly as you do. Built-to-last quality features a 1-piece body crafted from 9-axis, CNC-precision-cut 6061-T6 bar stock aluminum. Pink anodized finish adds corrosion resistance. The smooth 10+1 stainless steel bearing system features an anti-corrosion coating. Stainless steel and titanium drag assembly with water-tight seal delivers reliable performance. Other highlights of the Rosa baitcast reel include custom-machined gears, adjustable magnetic brakes, titanium crank arm, 18-lb drag, 29-per-crank line pickup, and laser-engraved cork grips and thumb bar. Includes custom neoprene reel case."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101327701_main?_a=AJAH1WI0",
      "title": "New! Bates Fishing The Goat Baitcase Reel",
      "offer": false,
      "brand": "Bates Fishing",
      "price": 299.99,
      "rating": 1,
      "description": "This isn't your daddy's bait caster. Bates Fishing The Goat Baitcast Reel is a true marvel of modern ingenuity and craftsmanship. You'd expect nothing less from the G.O.A.T. Each reel begins as a solid block of 6061-T6 bar stock aluminum and is cut on a 9-axis CNC machine bringing each shape and specification to life with the highest level of precision technology can achieve. Frames are then assembled and anodized with a clear-coat finish. The 10+1 stainless steel bearings have an anti-corrosion coating. Stainless steel and titanium drag assembly with water-tight seal delivers reliable performance. Other highlights of the Goat baitcast reel include adjustable magnetic brakes, titanium crank arm, 20-lb drag, 26-per-crank line pickup, and laser-engraved cork grips and thumb bar. Includes custom neoprene reel case."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101327700_main?_a=AJAH1WI0",
      "title": "New! Bates Fishing El Jefe Baitcast Reel",
      "offer": false,
      "brand": "Bates Fishing",
      "price": 299.99,
      "rating": 4,
      "description": "From the lower Laguna Madre up to Matagorda Bay, down the Brazos and across every Lone Star lake, Bates Fishing El Jefe Baitcast Reel was built for the boss, no matter which water you might rule. Keeping in step with the rest of the Bates line of reels, El Jefe features a solid 1-piece aluminum frame that's CNC-cut from 6061-T6 bar stock aluminum anodized blue for corrosion resistance. It's equipped with the finest combination of guts and components to give every angler unrivaled performance and reliability. The 10+1 stainless steel bearings have an anti-corrosion coating. Stainless steel and titanium drag assembly with water-tight seal delivers reliable performance. Other highlights of the El Jefe baitcast reel include adjustable magnetic brakes, titanium crank arm, 17-lb drag, 33-per-crank line pickup, and laser-engraved cork grips and thumb bar. Includes custom neoprene reel case."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101327703_main?_a=AJAH1WI0",
      "title": "New! Bates Fishing Salty Baitcast Reel",
      "offer": true,
      "brand": "Bates Fishing",
      "orig": 400,
      "price": 329.99,
      "rating": 3,
      "description": "Inshore ingenuity is the name of the game when it comes to the Bates Fishing Salty Baitcast Reel. It's perfect for those bass fishermen turned saltwater angler, or for the coastal guy or gal who just prefers a baitcaster's accuracy and versatility. Salty is the first fully machined, low-profile bait caster manufactured from bar-stock aluminum with an anodized finish and matched together with stainless steel components. The high level of corrosion resistance ensures exceptional performance in every saltwater or freshwater environment. Construction details include CNC-precision-cut 6061-T6 bar stock aluminum 1-piece-body, 10+1 stainless steel bearings with anti-corrosion coating, 20-lb. drag, adjustable magnetic brakes, 26-per-crank line pickup, and laser-engraved cork grips and thumb bar. Stainless steel and titanium drag assembly with water-tight seal delivers reliable performance. Includes custom neoprene reel case"
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101327702_main?_a=AJAH1WI0",
      "title": "New! Bates Fishing Abe 150 Baitcasting Reel",
      "offer": false,
      "brand": "Bates Fishing",
      "price": 299.99,
      "rating": 2,
      "description": "Bates Fishing Abe 150 Baitcasting Reel is sure to serve the modern angler for years to come and probably bring a little luck, too. The low-profile, 1-piece frame is CNC-precision-cut 6061-T6 bar stock aluminum with an anti-corrosion, copper anodized finish. Its guts are a combination of coated aluminum and copper parts with a carbon-fiber crank arm. The 10+1 stainless steel bearings have an anti-corrosion coating. Stainless steel and titanium drag assembly with water-tight seal delivers reliable performance. Other highlights of the Abe 150 baitcast reel include adjustable magnetic brakes, 20-lb drag, 26-per-crank line pickup. Includes custom neoprene reel case."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/2428726.json?$Prod_PLPThumb$",
      "title": "Offshore Angler Inshore Extreme Baitcast Reel",
      "offer": true,
      "brand": "Offshore Angler",
      "orig": 150,
      "price": 99.99,
      "rating": 4,
      "description": "Our recrafted Offshore Angler® Inshore Extreme Baitcast Reel is exceptionally light and compact, so it balances perfectly on a premium inshore rod and is a joy to palm, yet all aspects of its performance—the features serious inshore fisherman love most about this reel—remain intact. As always, we build the Inshore Extreme to fit the way tournament anglers fish. From its 1-piece machined-aluminum frame and double-anodized, machined-aluminum drilled spool, to its Recurve handle and drag star, this low-profile baitcaster's design is sleek, light and functional. The frame has 3 built-in drain holes, so your washdown water can drain and dry following the rinse. All additional features are geared for performance, including the quality 7-bearing system with 3 corrosion-resistant bearings in strategic locations, plus Powerlock™ instant anti-reverse; our Dual Braking System™, with click-adjustable magnetic and 6-pin centrifugal cast control systems working in concert; the hard titanium-coated line guide. You'll especially like the pin-release sideplate that enables you to make lightning-quick brake adjustments on the fly, the satisfying feel of the Soft Touch thumb bar, and the built-in lube port for those pre-outing touch-ups. When you're ready to reload your best rods, odds are that the lightweight, incredibly compact Offshore Angler Inshore Extreme will more than fill the bill for you."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/2995330.json?$Prod_PLPThumb$",
      "title": "Offshore Angler Ocean Master 4000 Baitcast Reel",
      "offer": false,
      "brand": "Offshore Angler",
      "price": 99.99,
      "rating": 3,
      "description": "The Offshore Angler™ Ocean Master® 4000 Baitcast Reel is a traditional round baitcast reel with a lightweight, exceptionally rigid 1-piece aluminum frame and aluminum sidecovers. Fitted with 3 Double Shielded corrosion-resistant stainless steel ball bearings, the Ocean Master Reel also features our Powerlock™ instant anti-reverse. Add to that an externally adjustable magnetic braking system that lets you make custom settings as conditions dictate. An impressive 6-disc drag system exerts consistent drag pressure, putting the brakes on the hardest runs. A deep, high-strength anodized aluminum spool is forged for added strength, plus gears use high-strength brass so you know it has the toughness to handle harsh environments and big fish. This saltwater reel also includes a ceramic line guide, a recurved forged-aluminum star drag, an audible bait clicker, and a durable aluminum handle. Our Offshore Angler Ocean Master 4000 Baitcast Reel is terrific when fishing for redfish, striper, grouper, and other saltwater game fish."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/151/master5_100846446_main?_a=AJAH1WI0",
      "title": "PENN Squall Baitcast Reel",
      "offer": true,
      "brand": "Penn",
      "orig": 300,
      "price": 209.95,
      "rating": 4,
      "description": "A nearshore workhorse, the PENN® Squall Baitcast Reel offers reliability beyond its modest price point. Its rugged Full Metal Body resists flexing, to keep the internals in alignment, and works in concert with the hard brass main gear to deliver smooth, powerful operation at all times. Magnetic casting brake for accurate, trouble-free casting; quality 5+1 stainless steel bearing system. PENN's powerful HT-100™ drag is renowned for wearing fish down without hesitation or chatter; line capacity rings on the spool keep you abreast of the line-out situation."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/151/master1_100846450_main?_a=AJAH1WI0",
      "title": "PENN Fathom Baitcast Reel",
      "offer": false,
      "brand": "Penn",
      "price": 319.95,
      "rating": 2,
      "description": "The Fathom delivers everything you'd expect from a baitcasting reel boasting the PENN® name. A full-metal body and crank side plate protects internal components like the smooth 6+1 stainless steel bearing system, brass main gear, and bearing-supported bronze pinion gear. PENN's legendary HT-100™ carbon-fiber drag washers apply smooth, relentless pressure at all settings. Adjust the dual-action casting brake to dial in control to match your preferences. Line-capacity rings tells you line status with a quick glance. TiN coated levelwind system lays line straight and even. Synchronized drag and level-wind system (400 size only)."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_100121742_main?_a=AJAH1WI0",
      "title": "Okuma Komodo SS Casting Reels",
      "offer": false,
      "brand": "Okuma",
      "price": 279.99,
      "rating": 3,
      "description": "Constructed with die-cast aluminum frames and sideplates, as well as heavy-duty stainless steel gearing and shafts, Okuma's Komodo SS Casting Reels are built to ensure you make the most of your time on the water. Corrosion-resistant coating stands up to repeated use in harsh freshwater or saltwater environments. Multidisc Carbonite drag system with a microclick star adjustment creates precise drag settings and puts perfect pressure on running fish. Machined anodized-aluminum spool reduces overall weight without sacrificing strength. Precision Japanese ABEC-5 spool bearings. Six-pin Velocity Control system handles a wide range of bait sizes. High-performance stainless steel-ball bearing system for smooth retrieves. Zirconium line inserts for use with braided line. Available in both left- and right-hand retrieve. Reliable dual anti-reverse system, synchronized levelwind that's optimized for braided line and an on/off baitclicker. Backed by a manufacturer's three-year warranty."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/3543970.json?$Prod_PLPThumb$",
      "title": "ProFishiency Krazy Baitcast Reel",
      "offer": false,
      "brand": "ProFISHiency",
      "price": 99.99,
      "rating": 4,
      "description": "Despite its name, the ProFISHiency Krazy Baitcast Reel puts a wealth of serious features at your disposal. As premium fishing gear goes, it's a whole new look, and the unique visual effects simply echo the topnotch performance that sets this reel apart from other baitcasters. Quick and smooth, this easy-handling low-profile design incorporates a sturdy graphite frame and sideplates with a machined aluminum spool. Inside, the hard brass pinion gear works with the aluminum main gear and crank shaft to deliver the strength to handle heavy loads, despite the system's lightweight design. Externally adjustable magnetic brake for precision casting; premium 9+1 system with stainless steel ball bearings and Zero Play anti-reverse; carbon fiber drag system; carbon fiber handle with premium cork knobs; aluminum drag star and spool tension knob."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_101296580_main?_a=AJAH1WI0",
      "title": "ProFISHiency P4-13 Baitcast Reel",
      "offer": false,
      "brand": "ProFISHiency",
      "price": 79.99,
      "rating": 4,
      "description": "When fishing gets tough and you are faced with adversity, the ProFISHiency P4-13 Baitcast Reel is your answer! This lightweight, extremely compact reel is built on a super-low profile graphite frame that nestles right into your palm, for amazing comfort and control. Equipped with an anodized aluminum spool plus ProFISHiency's externally adjustable magnetic braking system that produces smooth long casts with fewer backlashes. Quality 10+1 bearing system with stainless steel ball bearings and Zero Play Anti-Reverse; smooth carbon fiber drag; aluminum handle with EVA knobs."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_100055129_main?_a=AJAH1WI0",
      "title": "Quantum PT Smoke S3 Baitcast Reel",
      "offer": true,
      "brand": "Quantum",
      "orig": 200,
      "price": 179.99,
      "rating": 3,
      "description": "A super-compact baitcaster with increased line capacity and long-cast ability? Sounds impossible, but here it is. The Quantum® PT Smoke® S3 Baitcast Reel defies the trend with both downsized palmability and all-around performance. The secret: a larger 35.5 mm fitted spool, plus a reconfigured ACS 4.0™ cast control system that's lighter and more sensitive than ever. Together, these advances deliver greater line capacity, longer casts, and more line pick-up per handle turn than similar-sized reels. Meanwhile, the low-profile PT Smoke S3 comes loaded with the features top anglers count on: rugged aluminum X-frame with PT Thumbar and gull-wing sidecover; full SaltGuard Protection; PT Line Memo technology; super-smooth PT gear design; premium 10+1 bearing system with 2 PT Speed Bearings, 3 PTAC anti-corrosion bearings, 5 stainless steel ball bearings, and 1 roller bearing for the Continuous Anti-Reverse™ clutch; easy-starting, micro-adjustable ACS 4.0 cast control with specialized brakes that disengage at about 5K rpm, for extra-long cast capability; powerful ceramic-carbon drag system; and a PT Power Handle with Zero Friction design. Smooth and strong, this reel fishes much bigger than it looks!"
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/100/master1_100031799_main?_a=AJAH1WI0",
      "title": "Uncle Buck's Crappie Reel",
      "offer": false,
      "brand": "Uncle Buck's",
      "price": 14.99,
      "rating": 3,
      "description": "When you're rigging up your long rods for trolling, spider rigging, or vertical jigging, our Uncle Buck's® Crappie Reel is the perfect reel for the job. Weighing only 3.2 oz., this well-designed specialty reel was made especially for crappie fishing. It features a strong graphite frame, an anti-reverse lever, audible bait clicker, and adjustable tension control to give you just the right touch for putting a limit of papermouths in the livewell. Comes pre-spooled with 6 lb. test monofilament."
    }
  ],
  "boating_sub": [
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_213/v1/ProductImages/200/master1_101276117_main?_a=AJAH1WI0",
      "title": "New! Aqua-Vu AV715c Saltwater Edition Underwater Viewing System",
      "offer": true,
      "brand": "Aqua-Vu",
      "orig": 700,
      "price": 599.99,
      "rating": 3,
      "description": "Taking everything from the proven AV715c underwater camera system and reinforcing it for saltwater readiness, the Aqua-Vu® AV715c Saltwater Edition Underwater Viewing System brings the industry's best pairing of performance and value. The 715c Saltwater Edition boasts a full 7 LCD and Aqua-Vu's patented XD Camera System, now in beautiful stainless steel. The camera stabilizer fin ensures clearer images. A sun shield allows easy display viewing while on the water, and a Video Out port lets you connect the Aqua-Vu to your own display for larger viewing. The sealed, 12V 7A battery runs up to 10 hours. Includes 75' of durable camera cable."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_142/v1/ProductImages/200/red_1510051118_main?_a=AJAH1WI0",
      "title": "HawkEye FishTrax 1C Color Handheld Fishfinder",
      "offer": false,
      "brand": "Hawkeye",
      "price": 149.99,
      "rating": 2,
      "description": "The HawkEye® FishTrax™ 1C Color Handheld Fishfinder dox-matrix fishfinder makes the perfect gift for the angler in your life—including yourself—who wants powerful fishfinding in convenient, compact form. The HawkEye FishTrax™ 1C Color Fishfinder sports dual-beam Intelligent Sonar with 100 levels of adjustment for perfectly fine-tuning your waterway, along with a built-in Ice Mode Digital Flasher for adjusting your display, multi-level depth ranges, auto-zoom bottom tracking with intensifying prey targeting, and 2 operating frequencies: 200 kHz and 83 kHz. Just toss the sonar sensor in the water or place it in the boat hull, and power on the display—and you're ready to find bites on the VirtuView™ HD bright display in vivid color. Includes foldable, trollable, boat-mountable transducer."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_10212724_main?_a=AJAH1WI0",
      "title": "HawkEye In-Dash Digital Depth Sounder",
      "offer": false,
      "brand": "Hawkeye",
      "price": 99.99,
      "rating": 4,
      "description": "The HawkEye® In-Dash Digital Depth Sounder updates 4 times per second to provide instant, uninterrupted depth readings from 2.5'–600' feet at speeds up to 63 mph. An easy way to say goodbye to the days of not knowing the depth with running your boat on a plane, this in-dash depth sonar's algorithmic programming virtually eliminates false depth readings while its EasyTouch™ programming allows 1-touch access to dual depth alarms. The oversized LCD reads depths in feet or meters, and uses SoftGlow™ backlighting for unmatched readability at night. Includes interchangeable black and white bezels, face plates, and a sun cover to protect the LCD during storage. Manufacturer's 2-year limited warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_1203140831_main?_a=ATO2BAA0",
      "title": "HawkEye D10DX In-Dash Depth Finder with Air & Water Temperature",
      "offer": true,
      "brand": "Hawkeye",
      "orig": 200,
      "price": 139.99,
      "rating": 1,
      "description": "The HawkEye® D10DX In-Dash Depth Finder With Air & Water Temperature provides instant depth readings that are updated four times per second. It also incorporates dual temperature displays, supplying both air and water temperatures. Once customized to your needs, there's no need to reprogram the system. The HawkEye D10DX includes a sun cover to protect the LCD during storage. Choose a model with a transom-mount for optimum performance. Features include a 30' transducer cable; an extended mounting bracket; a removable transom bracket; shoot-thru sonar technology; an interchangeable black/white face system; and green, Soft-Glow™ LED backlighting. Maximum depth range: 200'. Minimum depth range: 2.5'. Dimensions: 2 dia. x 1.75 deep."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_196/v1/ProductImages/200/master1_100213651_main?_a=ATO2BAA0",
      "title": "Hawkeye DepthTrax 1H Handheld Depth Finder",
      "offer": false,
      "brand": "Hawkeye",
      "price": 69.99,
      "rating": 3,
      "description": "The Hawkeye® DepthTrax® 1H Handheld Depth Finder utilizes proprietary sonar technology to emit 300W sonar pulses 4 times per second, while algorithmic programming virtually eliminates false readings from being displayed on the LCD screen. It has an unbreakable ABS plastic outer shell and incorporates Inductive Switching Technology (IST) to eliminate switch holes in the housing. This combines with dual seals on the battery and transducer caps for waterproof performance to depths up to 200'. You can track water depth readings from 1.5'–300', and also monitor water and air temperatures via the SoftGlow™ backlit display. It has an automatic depth range adjustment and runs up to 25 hours on a 9V battery (not included). The Hawkeye DepthTrax 1H Handheld Depth Finder has an integrated lanyard, and is effective and handy for use from shorelines, docks, kayak fishing, PWC, boats, or in ice fishing. Manufacturer's 2-year limited warranty. 8 H x 2 W x 2 D"
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/2451017.json?$Prod_PLPThumb$",
      "title": "iBobber Bluetooth Smart Castable Fishfinder",
      "offer": true,
      "brand": "IBobber",
      "orig": 100,
      "price": 89.99,
      "rating": 4,
      "description": "Discover the smallest and lightest personal sonar depth finder on the market, the iBobber® Bluetooth® Smart Castable Fishfinder. With this revolutionary Bluetooth fishfinder, you just cast, find, and catch. Built-in Bluetooth Smart technology lets the iBobber Bluetooth Smart Castable Fishfinder communicate with a free app on your smartphone or tablet even without a cell signal, from up to 100' away. Optimized 42°/118kHz sonar reaches as deep as 135' and a beam width up to 243' to display multiple fish sizes directly on your device screen. Plus, iBobber serves up waterbed mapping up to 300', area-specific weather, trip log, GPS tagging, water temperature, a fish alarm, and a strike alarm. You've never seen this much tech in a fishing bobber, and neither have your fishing buddies, or the fish. Put sonar in your tackle box and find more fish every time."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_190/v1/ProductImages/200/master1_100856189_main?_a=AJAH1WI0",
      "title": "MarCum M5L Sonar Flasher",
      "offer": false,
      "brand": "MarCum",
      "price": 524.98,
      "rating": 2,
      "description": "The difference between a good angler and a great one is their attention to detail. The MarCum® M5L Sonar Flasher provides that element in a 3-color, real-time flasher that's as scientifically advanced today as it was when released nearly 2 decades ago. Feature specs are useless unless they help you catch fish, which is why the M5L delivers target separation down to 3/4 for more than just a bullet point on a product box. That kind of sonar clarity lets you differentiate fish from the bottom, or schooling fish from each other, to target the largest fish in the group and catch them. With the dual-beam transducer, at the push of a button, an angler can quickly narrow the sonar cone angle and focus on fish within any striking distance of the bait. SuperFineLine (SFL) is another Marcum exclusive, and it's like having a high-definition mode for your flasher, all while improving standard definition from 1-1/2 to 3/4 for the entire water column. Max Brightness and Clarity (MBC) lighting ensures that sonar targets are as bright as they are sharp, digitally transposed on an extra-smooth and quiet brushless platform for years of maintenance-free service. The M5L adds patented zoom technology, moveable anywhere in the water column, giving you the freedom and precision not only for bottom-hugging species down to 160'. Industry-leading 12-step interference rejection is so advanced, it's also patented. That makes it compatible with any 2,000kHz sonar, along with other frequencies. The M5L sonar system pumps out 2,500W of expertly managed power from a lightweight, long-lasting LifePO4 lithium battery. This shaves a significant amount of the weight from the entire system, ensuring both angler and flasher never run out of juice. Lithium technology is easy on the pocketbook, too, offering lower cost of ownership by extending the life and use of any Marcum for thousands of charge cycles. The M5L includes a deluxe, padded soft case that provides years of protection in transit and use."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_198/v1/ProductImages/200/master1_100069155_main?_a=AJAH1WI0",
      "title": "MarCum M1 Ice Sonar Flasher System",
      "offer": true,
      "brand": "MarCum",
      "orig": 400,
      "price": 279.98,
      "rating": 3,
      "description": "Part of the most advanced line of flasher-sonars ever built, the MarCum® M1 Ice Sonar Flasher System offers brushless, dead-quiet operation with dazzling bright and crisp color definition of bottom, fish, baitfish, and your lure, all illuminated on the highest-resolution display available in a commercial-grade flasher. Unlike ordinary ice flashers, the MarCum M1 Ice Sonar Flasher System delivers advanced features like split-screen zoom, patented interference rejection, selectable depth ranges, and 1000W expertly managed output power so you'll always know if you're angling for a school of bait fish or the catch of the day. Includes 8' transducer cable, rechargeable 12V 7A battery, 3-stage automatic battery charger, and deluxe padded red soft carrying pack. Manufacturer's 2-year limited system warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_175/v1/ProductImages/200/master1_100201635_main?_a=AJAH1WI0",
      "title": "MarCum LX-i Digital Handheld Sonar",
      "offer": false,
      "brand": "MarCum",
      "price": 114.98,
      "rating": 4,
      "description": "The ultimate in portable sonar, the MarCum® LX-i Digital Handheld Sonar stands barely the size of a flashlight yet has full-featured sonar power, allowing easy 1-hand depth- and fish-finding on ice. No fumbling with separate transducers—just press the face of the MarCum LX-i Digital Handheld Sonar against wet ice, and digital depth immediately appears on the large LCD. 2,500W power ensures maximum use. The convenient 12° cone angle gives a generous look below the surface, and the top-mounted digital display presents vital information at a glance. Fish Alarm and a low-battery indicator keep you in the know. Automatic shutoff extends battery life. This MarCum Handheld sonar runs up to 20 hours on a 6V battery (included) and comes in a rugged, padded carrying case. Mfrs. 1-year limited warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100809672_main?_a=AJAH1WI0",
      "title": "MarCum MX-7GPS Lithium-Powered Sonar/GPS Combination Unit",
      "offer": true,
      "brand": "MarCum",
      "orig": 800,
      "price": 679.98,
      "rating": 2,
      "description": "The MarCum® MX-7GPS Lithium-Powered Sonar/GPS Combination Unit brings the best of both world: pinpoint positional accuracy and long-heralded MarCum sonar, giving you double the ice-fishing advantages. Dual-beam precision digital sonar offers best-in-class widest and narrowest viewing angles on the market. A 20° ultra-wide-angle sonar cone sees fish further to the sides, giving you an advantage for finding and catching. An 8° narrow-beam transducer targets only the fish directly beneath you at the push of a button, and overcomes standard sonar issues on steep breaks. The patented, 12-setting interference rejection lets you tune out noise better than ordinary sonar systems, with fine-tuning controls of gain modes, ping speed, and cone angle. The internal GPS receiver takes you to the spot and brings you back time after time. Built-in Navionics® Basemap provides more lakes and better coverage from a host of sources. A microSD card slot allows custom, optional mapping upgrades. The True-Time 7 LCD works in tandem with sonar to offer all screens in true realtime-display with zero latency and no lag. Luminance reaches up to 1,000 nits for incredible clarity in any lighting conditions. Manual depth ranges of 10, 20, 40, 60, 80, 120, 180, 240, and 300 lock in your viewing range, while auto mode selects the closest appropriate range for each ice hole you dunk your 'ducer in. Dynamic mode adjusts for the entire water column, using the full display and maximizing detail, while manual dynamic allows you to fine-tune your depth range to the exact foot, then lock it in. Optimal single-frequency sonar (200 kHz) doesn't require an adjustment in frequency to go from wide cone angles to narrow, so you don't lose sensitivity because of signal manipulation. 4 viewing options let you personalize your presentations. This powerhouse MarCum sonar/GPS unit includes a deluxe padded soft pack, 8' of Kevlar-reinforced transducer cord, 12V 10A lithium LifePO4 battery, and 3A rapid charger. Mfrs.'s 2-year limited warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_135/v1/ProductImages/200/master1_100118844_main?_a=AJAH1WI0",
      "title": "MarCum LX-7 Digital Sonar/Lithium Shuttle Combo",
      "offer": false,
      "brand": "MarCum",
      "price": 729.98,
      "rating": 3,
      "description": "Find the fish fast with the MarCum® LX-7 Digital Sonar/Lithium Shuttle Combo. The lightweight shuttle with a 5-gal. bucket (not shown) makes transport a breeze, while the 8 flat-panel LCD screen makes reading the sonar data easy and intuitive. 800x600 resolution delivers clarity, while a moveable zoom, 1/2 target separation, and split-screen capability make it easy to shift your focus. The MarCum LX-7 Digital Sonar/Lithium Shuttle Combo boasts a dual-beam 8°/20° transducer. This MarCum combo includes a long-lasting 12V 12A with 4,800W peak-to-peak power. Manufacturer's 2-year limited warranty on sonar system, 1-year limited warranty on the shuttle."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100893818_main?_a=AJAH1WI0",
      "title": "MarCum MX-7GPSLI Sonar/GPS Combination Unit with Lithium Shuttle",
      "offer": true,
      "brand": "MarCum",
      "orig": 900,
      "price": 779.98,
      "rating": 4,
      "description": "The MarCum® MX-7GPS Sonar/GPS Combination Unit with Lithium Shuttle brings the best of both worlds: pinpoint positional accuracy and long-heralded MarCum sonar, giving you double the ice-fishing advantages. Dual-beam precision digital sonar offers best-in-class widest and narrowest viewing angles on the market. A 20° ultra-wide-angle sonar cone sees fish further to the sides, giving you an advantage for finding and catching. An 8° narrow-beam transducer targets only the fish directly beneath you at the push of a button, and overcomes standard sonar issues on steep breaks. The patented, 12-setting interference rejection lets you tune out noise better than ordinary sonar systems, with fine-tuning controls of gain modes, ping speed, and cone angle. The internal GPS receiver takes you to the spot and brings you back time after time. Built-in Navionics® Basemap provides more lakes and better coverage from a host of sources. A microSD card slot allows custom, optional mapping upgrades. The True-Time 7 LCD works in tandem with sonar to offer all screens in true realtime-display with zero latency and no lag. Luminance reaches up to 1,000 nits for incredible clarity in any lighting conditions. Manual depth ranges of 10, 20, 40, 60, 80, 120, 180, 240, and 300 lock in your viewing range, while auto mode selects the closest appropriate range for each ice hole you dunk your 'ducer in. Dynamic mode adjusts for the entire water column, using the full display and maximizing detail, while manual dynamic allows you to fine-tune your depth range to the exact foot, then lock it in. Optimal single-frequency sonar (200 kHz) doesn't require an adjustment in frequency to go from wide cone angles to narrow, so you don't lose sensitivity because of signal manipulation. 4 viewing options let you personalize your presentations. The bundled Lithium Shuttle boasts up to 40 hours of continuous run time, a battery-status indicator, dual USB ports, dual rod holders, dual transducer support arm mounts, an articulating handle with locking spokes, and integrated cable storage and grips. This powerhouse MarCum sonar/GPS unit includes the Lithium Shuttle, 8' of Kevlar®-reinforced transducer cord, 12V 12amp/h internal lithium ION polymer battery, and 3A rapid charger. Manufacturer's 2-year limited"
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_198/v1/ProductImages/200/master1_100069154_main?_a=AJAH1WI0",
      "title": "MarCum M3L Sonar Flasher",
      "offer": false,
      "brand": "MarCum",
      "price": 424.98,
      "rating": 1,
      "description": "The MarCum® M3L Sonar Flasher is still built on the foundation of MarCum's very first sonar. A workhorse of the lineup, the MarCum M3L flasher exhibits many patented MarCum features, such as moveable zoom anywhere in the water column, a key angler advantage that put Marcum on the map. MarCum devices for the past 2 decades have been sought after for moveable zoom alone, as this patented feature forever changed the icescape. With the ability to move through zoom anywhere in the water column, the M3L flasher excels for bottom-dwellers such as walleye to suspending fish like bluegill, crappie, and lake trout. Crosstalk between flashers exists when multiple units are in close proximity, and the Marcum noise-cancelling interference rejection system is so effective at removing that clutter, it's patented, too. This is true for sonar systems in the 2,000kHz band as well as other frequencies, covering all bases on ice. The M3L packs 2,000W peak-to-peak power through a whisper-quiet and maintenance-free brushless motor. Boasting the widest single-beam transducer on the market, the M3L comes with an ultra-wide and industry-leading 20° of coverage. With a sonar footprint of this magnitude, anglers have the most expansive view of what's happening below the ice. Standard-definition sonar in the M3L provides 2 target separation to define jig from fish, fish from other fish in the school, or fish from bottom and nearby cover. Target separation improves to 1 with patented the MarCum zoom mode, bringing in high-definition details of the area being targeted. Like its big-brother M5L, the M3L is also fueled by a lightweight, long-lasting LifePO4 lithium battery. This shaves a significant amount of the weight from the entire system, ensuring both angler and flasher never run out of juice. Lithium technology is easy on the pocketbook, too, offering lower cost of ownership by extending the life and use of any Marcum for thousands of charge cycles. The M3L sonar flasher includes a deluxe, padded soft case that provides years of protection in transit and use."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_174/v1/ProductImages/200/master1_100860101_main?_a=AJAH1WI0",
      "title": "MarCum LX-7L Lithium LiFePO4 Digital Ice-Fishing Sonar Fish Finder",
      "offer": true,
      "brand": "MarCum",
      "orig": 700,
      "price": 599.98,
      "rating": 3,
      "description": "From the ice age to the digital age, the vanguard MarCum® LX-7L Lithium LiFePO4 Digital Ice-Fishing Sonar Fish Finder has forever transformed the game of hunting fish on frozen water. Over a decade of cutting-edge sonar design in the making, the radically innovative LX-7L Lithium LiFePO4 has been built with the optimum blend of sonar DNA from MarCum LX Flasher and Digital Fish Finding technologies. A true breakthrough in big picture ice sonar, LX-7L Lithium LiFePO4 presents anglers with an incredible interactive ice-fishing experience in a panoramic, 8 LCD environment with 4 vividly rich color palettes. Multiple industry-exclusive features provide a dazzling array of precious fish-finding intel. Fully user-defined on-screen dashboard displays digital depth, battery voltage, range, gain, interference rejection, target adjust, or any combination thereof. The LX-7L Lithium LiFePO4 Multifaceted Sonar Display also gives anglers fully customize window views, including water-column vertical, vertical zoom, flasher-dial, and traditional horizontal LCD graph displays. Sonar Footprint technology displays scan area at any depth, with either 8° degree or 20° transducer cone angles. This provides a keen awareness of fish targets relative to the transducer and your lure, and also helps prevent adjacent non-MarCum sonar users from picking up interfering LX-7L Lithium LiFePO4 pulses. Includes a LiFePO4 12V 10A battery, 3A rapid-charge charger, deluxe padded red soft storage pack, and snow shield faceplate. Manufacturer's 2-year limited warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100069158_main?_a=AJAH1WI0",
      "title": "Marcum M1 Flasher Lithium Combo System Sonar Fishfinder",
      "offer": false,
      "brand": "MarCum",
      "price": 399.98,
      "rating": 3,
      "description": "Part of the most advanced line of flasher-sonars ever built, the Marcum® M1 Flasher Lithium Combo System Sonar Fishfinder steps up your angling game like never before. This Marcum fishfinder offers brushless, dead-quiet operation with dazzling bright and crisp color definition of bottom, fish, baitfish, and your lure, all illuminated on the highest-resolution display available in a commercial-grade flasher. With advanced features like split-screen zoom, patented interference rejection, and 1,000W of expertly managed output power, the Marcum M1 Flasher Lithium Combo System Sonar Fishfinder has the raw power and refined performance to excel every time. You'll always know if you're angling for a school of bait fish or the catch of the day. This Marcum flasher utilizes a 20° ice transducer and patented Multiple Step Interference Rejection to deliver 2 target separation. Selectable depth ranges of 20', 40', 80', and 160' allow customized operation, and the split-screen 5' zoom with Bottom Lock gives incredible presentation of your next big bites. The onboard battery status indicator keeps you informed, and its powerful battery runs up to 40 continuous hours. Dual USB power ports and two 1/4-20 ports allow additional accessories, while dual rod holders let you kick back. An inverted transducer rest eliminates freeze-up, and an articulating handle with locking spokes adjusts to fit most ice sonar systems. Includes 8' transducer cable, 12V 12Ah li-ion polymer battery, 3Ah charger, and 5-gallon transit bucket. Manufacturer's 2-year limited system warranty and 1-year limited shuttle/battery warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_183/v1/ProductImages/200/master1_100069160_main?_a=AJAH1WI0",
      "title": "Marcum M5 Flasher Lithium Combo System Sonar Fishfinder",
      "offer": false,
      "brand": "MarCum",
      "price": 699.99,
      "rating": 4,
      "description": "Part of the most advanced line of flasher-sonars ever built, the Marcum® M5 Flasher Lithium Combo System Sonar Fishfinder steps up your angling game like never before. This Marcum fishfinder offers brushless, dead-quiet operation with dazzling bright and crisp color definition of bottom, fish, baitfish, and your lure, all illuminated on the highest-resolution display available in a commercial-grade flasher. With advanced features like split-screen zoom, patented interference rejection, and 1,000W of expertly managed output power, the Marcum M5 Flasher Lithium Combo System Sonar Fishfinder has the raw power and refined performance to excel every time. You'll always know if you're angling for a school of bait fish or the catch of the day. This Marcum flasher utilizes a 20° ice transducer and patented 12 Step Interference Rejection to deliver 3/4 target separation. Selectable depth ranges of 20', 40', 80', and 160' allow customized operation, and the split-screen 5' zoom with Bottom Lock gives incredible presentation of your next big bites. The onboard battery status indicator keeps you informed, and its powerful battery runs up to 40 continuous hours. Dual USB power ports and two 1/4-20 ports allow additional accessories, while dual rod holders let you kick back. An inverted transducer rest eliminates freeze-up, and an articulating handle with locking spokes adjusts to fit most ice sonar systems. Includes 8' transducer cable, 12V 12Ah li-ion polymer battery, 3Ah charger, and 5-gallon transit bucket. Manufacturer's 2-year limited system warranty and 1-year limited shuttle/battery warranty."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100214885_main?_a=AJAH1WI0",
      "title": "Raymarine Element 9 HV CHIRP Sonar/GPS Fish Finder",
      "offer": false,
      "brand": "Raymarine",
      "price": 899.99,
      "rating": 2,
      "description": "If knowledge equates to power, the Raymarine® Element 9 HV CHIRP Sonar/GPS Fish Finder makes you the most powerful angler on the water. This performance-pushing Raymarine fish finder keeps you a step ahead of th game with the sharpest views of the underwater world. Acclaimed, exclusive HyperVision™ 1.2 MHz extra-high-resolution sonar takes DownVision, SideVision, and Raymarine RealVision 3D sonar to the next level of precision imaging and fish indentation. You'll see structures, vegetation, and fish with photo-like clarity. And the power of the Raymarine Element 9 HV CHIRP Sonar/GPS Fish Finder doesn't stop there—an onboard, quad-core processor delivers instantaneous chart redraw, fast response, and smooth RealVision 3D imaging. The Raymarine Element keeps you on target with simple keypad controls and an angler-centric LightHouse Sport operating system, so you can focus on the fish, not the helm. An oversized waypoint key puts you on your favorite spots, and Element's industry-unique RealBathy™ personal depth map generator even lets you make your own high-definition bathymetric maps on the fly."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_187161_main?_a=AJAH1WI0",
      "title": "Raymarine Axiom 9 CHIRP RealVision Fishfinder/Chartplotter with Navionics+ Chart Card - Display Model",
      "offer": true,
      "brand": "Raymarine",
      "orig": 2000,
      "price": 1549.99,
      "rating": 4,
      "description": "Introducing the Raymarine® Axiom™ 9 CHIRP RealVision Fishfinder/Chartplotter with Navionics+ Chart Card - Display Model: a powerful new fishfinder chartplotter unlike any you've seen. The Axiom 9 features a 9 ultra-strong glass touchscreen display with Raymarine's powerful new LightHouse 3 operating system, an intuitive interface that recreates the familiar style of a tablet or smartphone. The supercharged processor inside the Axiom 9 allows expansion so its capabilities can grow as needed. It supports incredible Raymarine accessories, including CHIRP DownVision, Quantum CHIRP radar, audio integration, instruments, cameras, and Evolution autopilot. This unique Raymarine fishfinder steps up to RealVision 3D with SideVision, DownVision, and CHIRP sonar using Raymarine's new 4-in-1 RealVision 3D transducer. Built-in Wi-Fi and Bluetooth® connectivity lets you pair your Axio with the latest Raymarine apps for your tablets and smartphones. The blazing-fast 10 Hz 72-channel GPS/GLONASS receiver provides heading updates 10 times per second and smooth onscreen tracking. True to its name, the Raymarine Axiom 9 CHIRP RealVision Fishfinder/Chartplotter with Navionics+ Chard Card comes bundles with industry-leading Navionics+, covering the North America region with full coastal mapping of the US and Canada, plus over 18,000 inland ponds, lakes, and rivers. You can also make your HD contour maps with your depth sounder and Navionics SonarChart Live. Includes surface and trunnion mounting kits, mounting hardware, power/data cable, 1m Raynet network cable, NMEA2000® network adapter, and installation instructions."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100234087_main?_a=AJAH1WI0",
      "title": "Simrad GO12 XSR with Active Imaging 3-in-1 and C-MAP Pro Fish Finder/Chartplotter Combo",
      "offer": false,
      "brand": "Simrad",
      "price": 2299.99,
      "rating": 2,
      "description": "Discover the easiest way to add GPS navigation, sonar, and even radar to your boat, with the Simrad® GO12 XSR with Active Imaging™ 3-in-1 and C-MAP Pro Fish Finder/Chartplotter Combo. This compact yet feature-packed multifunction display provides maximum intuitive functionality for sportboats, dayboats, and center consoles. Behind every super-bright GO series touchscreen lies a built-in GPS receiver, echosounder, wireless connectivity, and NMEA 2000® networking. Navigate, connect with mobile devices, control accessories like your on-board sound system, and choose from an array of built-in sonar support to cruise with confidence or fish like a pro. The Active Imaging 3-in-1 sonar transducer delivers superior clarity and the highest resolution images of fish and structure at a longer range than any other structure imaging technology. Wireless connectivity to smartphones and tablets keeps you in control from anywhere on board, almost like a second display. This Simrad chartplotter delivers intuitive touchscreen controls that smartphone and tablet users will find instantly familiar. Customize your home screen with the features you use most, and see everything you need on screen at once with adjustable split-screen views. Mark waypoints on charts with a touch, and easily assign meaningful names and symbols that make them easier to find on your next trip. Mirrors your display on a compatible smartphone or tablet. Wireless also enables easy online software updates via any internet hotspot. Industry-standard NMEA 2000® connectivity on the Simrad GO12 XSR with Active Imaging 3-in-1 and C-MAP Pro Fish Finder/Chartplotter Combo offers a wide range of expansion and integration options: monitor your boat's engine performance and fuel efficiency, steer your boat with a Simrad autopilot, or control your on-board entertainment system from your Simrad fish finder."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_101159245_main?_a=AJAH1WI0",
      "title": "SIMRAD GO12 XSE Chartplotter with Active Imaging 3-in-1 Sonar and C-MAP DISCOVER Chart",
      "offer": false,
      "brand": "Simrad",
      "price": 2549.99,
      "rating": 4,
      "description": "Get more from every day on the water with the SIMRAD® GO12 XSE Chartplotter with Active Imaging™ 3-in-1 Sonar and C-MAP DISCOVER Chart. This multifunction display serves up a built-in GPS receiver, echosounder, wireless connectivity, and industry-standard NMEA 2000® networking. Navigate, connect with mobile devices, control accessories like your on-board sound system, and choose from an array of built-in sonar features. Intuitive touch-screen controls bring easy operation with a design that smartphone and tablet users will find instantly familiar. Customize your home screen with the features you use most, and see everything you need on screen at once with adjustable split-screen views. Mark waypoints on charts with a touch, and easily assign meaningful names and symbols that make them quick to find when you are planning your next trip. C-MAP DISCOVER charts feature ultra-wide coverage in the US and Canada. DISCOVER charts include full-featured Vector Charts, Custom Depth Shading, Tides & Currents, and the very best of C-MAP high-resolution bathymetric contours, including integrated Genesis® data. Use C-MAP Easy Routing™ to make planning your next trip on the water as easy as planning a trip in the car, and always have the latest DISCOVER chart data with 12 months of free online updates. Built-in wireless connectivity mirrors your display to a compatible smartphone or tablet, giving you instant access to charts, radar, and other functionality from anywhere on board. Wireless also enables easy online software updates via an internet hotspot. NMEA 2000 connectivity offers a wide range of expansion and integration options: Monitor your boat's engine performance and fuel efficiency, steer your boat with a Simrad autopilot, or control your onboard entertainment system from your GO series display. Choose from a wide range of fish-finding sonar options to suit your vessel, from CHIRP or traditional sonar transducers for a classic fish-finder view, or get all your fish-finding sonar in a single transducer with Active Imaging Imaging 3-in-1. Active Imaging brings the world-class clarity and target separation of CHIRP Sonar, plus incredible detail of reefs, drop-offs, and wrecks from SideScan and DownScan Imaging™, giving you powerhouse performance every time you hit the water."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100935831_main?_a=AJAH1WI0",
      "title": "Simrad Cruise 9 Fishfinder/Chartplotter with US Coastal Map and 83/200 Transducer",
      "offer": false,
      "brand": "Simrad",
      "price": 729.99,
      "rating": 3,
      "description": "Easy to use, with intuitive features, the Simrad® Cruise 9 Fishfinder/Chartplotter with US Coastal Map and 83/200 Transducer offers full-function CHIRP sonar and GPS navigation to enhance every day on the water. Its big, bold 9 screen presents clear displays even in direct sunlight, with crisp 800x480-pixel resolution and selectable full- and split-screen views; the rotary dial and keypad controls allow effortless navigation through its array of menus, routes, and readings. The Cruise 9 comes pre-loaded with a C-MAP® US Coastal map and worldwide basemap, and accepts a wide range of enhanced mapping options. Includes 83/200 sonar transducer."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100919478_main?_a=AJAH1WI0",
      "title": "Simrad NSS evo3S Fish Finder/Chartplotter with C-MAP US Enhanced Charts",
      "offer": false,
      "brand": "Simrad",
      "price": 2399.0,
      "rating": 2,
      "description": "Take total control of your on-water experience with the Simrad® NSS evo3S Fish Finder/Chartplotter with C-MAP® US Enhanced Charts. This Simrad fish finder brings the acclaimed SolarMAX™ IPS display with exceptional clarity and ultra-wide viewing angles in any light conditions, while the practically supercharged iMX 8 high-performance processor delivers lightning-fast response times for seamless screen transitions. Choose between all-weather touch-screen technology or the integrated keypad with an innovative rotary dial. Monitor and control all of your onboard electronics with simple menus, customizable split-screen layouts, and a programmable function key for 1-button access to favorite functions. 1kW CHIRP-enabled sonar provides exceptional bottom-tracking and fish-finding performance, including support for dual-channel CHIRP transducers that deliver multiple-depth-range coverage from a single unit. Dual transducer ports offer the convenience of connecting multiple transducers to a single display. Better-than-ever processing power easily powers Active Imaging™, providing picture-like views of fish-holding structure, and ForwardScan® sonar, which offers the safest on-water experience with crystal-clear views of the bottom ahead. See it all on your choice of any split-screen combination, views in 3D, Navigation perspective, or Radar overlay. Upgraded chart detail for the US includes 3 key new features: high-resolution bathymetry with 1' contours, C-MAP Reveal embedded for Florida, and Easy-Routing capabilities. Industry-standard connectivity makes it easy to create multi-display systems and link displays to all of your on-board electronics; while the new iMX 8 high-performance processor ensures engine and fuel monitoring in real-time, control of onboard sound systems, and much more. Expand your system with Simrad modules and accessories, fish smarter with the game-changing S5100 or StructureScan® 3D, and free your hands from the wheel with a fully integrated Simrad autopilot. Mirror your display to compatible iOS and Android devices and enjoy access to charts, radar, sonar, engine data, and more from anywhere onboard. Wireless connectivity also enables easy online software upgrades through an internet hotspot, giving you access to the latest features and accessory support. Or download the Simrad app for an even richer experience, from device registration and manual downloads to saving waypoints and your favorite fishing spots, accessible on and off the water."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_101062336_main?_a=AJAH1WI0",
      "title": "SIMRAD GO9 XSE Chartplotter with Active Imaging 3-in-1 Sonar and C-MAP DISCOVER Chart",
      "offer": false,
      "brand": "Simrad",
      "price": 1199.0,
      "rating": 4,
      "description": "Get more from every day on the water with the SIMRAD® GO9 XSE Chartplotter with Active Imaging™ 3-in-1 Sonar and C-MAP DISCOVER Chart. This multifunction display serves up a built-in GPS receiver, echosounder, wireless connectivity, and industry-standard NMEA 2000® networking. Navigate, connect with mobile devices, control accessories like your on-board sound system, and choose from an array of built-in sonar features. Intuitive touch-screen controls bring easy operation with a design that smartphone and tablet users will find instantly familiar. Customize your home screen with the features you use most, and see everything you need on screen at once with adjustable split-screen views. Mark waypoints on charts with a touch, and easily assign meaningful names and symbols that make them quick to find when you are planning your next trip. C-MAP DISCOVER charts feature ultra-wide coverage in the US and Canada. DISCOVER charts include full-featured Vector Charts, Custom Depth Shading, Tides & Currents, and the very best of C-MAP high-resolution bathymetric contours, including integrated Genesis® data. Use C-MAP Easy Routing™ to make planning your next trip on the water as easy as planning a trip in the car, and always have the latest DISCOVER chart data with 12 months of free online updates. Built-in wireless connectivity mirrors your display to a compatible smartphone or tablet, giving you instant access to charts, radar, and other functionality from anywhere on board. Wireless also enables easy online software updates via an internet hotspot. NMEA 2000 connectivity offers a wide range of expansion and integration options: Monitor your boat's engine performance and fuel efficiency, steer your boat with a Simrad autopilot, or control your onboard entertainment system from your GO series display. Choose from a wide range of fish-finding sonar options to suit your vessel, from CHIRP or traditional sonar transducers for a classic fish-finder view, or get all your fish-finding sonar in a single transducer with Active Imaging Imaging 3-in-1. Active Imaging brings the world-class clarity and target separation of CHIRP Sonar, plus incredible detail of reefs, drop-offs, and wrecks from SideScan and DownScan Imaging™, giving you powerhouse performance every time you hit the water."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master2_100919479_main?_a=AJAH1WI0",
      "title": "Simrad NSS evo3S Fish Finder/Chartplotter with C-MAP US Enhanced Charts and HALO20+ Radar",
      "offer": false,
      "brand": "Simrad",
      "price": 6199.99,
      "rating": 1,
      "description": "Take total control of your on-water experience with the Simrad® NSS evo3S Fish Finder/Chartplotter with C-MAP® US Enhanced Charts and HALO20+ Radar. This Simrad fish finder brings the acclaimed SolarMAX™ IPS display with exceptional clarity and ultra-wide viewing angles in any light conditions, while the practically supercharged iMX 8 high-performance processor delivers lightning-fast response times for seamless screen transitions. Choose between all-weather touch-screen technology or the integrated keypad with an innovative rotary dial. Monitor and control all of your onboard electronics with simple menus, customizable split-screen layouts, and a programmable function key for 1-button access to favorite functions. 1kW CHIRP-enabled sonar provides exceptional bottom-tracking and fish-finding performance, including support for dual-channel CHIRP transducers that deliver multiple-depth-range coverage from a single unit. Dual transducer ports offer the convenience of connecting multiple transducers to a single display. Better-than-ever processing power easily powers Active Imaging™, providing picture-like views of fish-holding structure, and ForwardScan® sonar, which offers the safest on-water experience with crystal-clear views of the bottom ahead. See it all on your choice of any split-screen combination, views in 3D, Navigation perspective, or Radar overlay. Upgraded chart detail for the US includes 3 key new features: high-resolution bathymetry with 1' contours, C-MAP Reveal embedded for Florida, and Easy-Routing capabilities. Industry-standard connectivity makes it easy to create multi-display systems and link displays to all of your on-board electronics; while the new iMX 8 high-performance processor ensures engine and fuel monitoring in real-time, control of onboard sound systems, and much more. Expand your system with Simrad modules and accessories, fish smarter with the game-changing S5100 or StructureScan® 3D, see further with legendary HALO™ Pulse Compression radar, and free your hands from the wheel with a fully integrated Simrad autopilot. Mirror your display to compatible iOS and Android devices and enjoy access to charts, radar, sonar, engine data, and more from anywhere onboard. Wireless connectivity also enables easy online software upgrades through an internet hotspot, giving you access to the latest features and accessory support. Or download the Simrad app for an even richer experience, from device registration and manual downloads to saving waypoints and your favorite fishing spots, accessible on and off the water."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_101159246_main?_a=AJAH1WI0",
      "title": "SIMRAD GO7 XSR Chartplotter with Active Imaging 3-in-1 Transducer and C-MAP DISCOVER Chart",
      "offer": false,
      "brand": "Simrad",
      "price": 999.0,
      "rating": 3,
      "description": "Get more from every day on the water with the SIMRAD® GO7 XSR Chartplotter with Active Imaging™ 3-in-1 Transducer and C-MAP DISCOVER Chart. This multifunction display serves up a built-in GPS receiver, echosounder, wireless connectivity, and industry-standard NMEA 2000® networking. Navigate, connect with mobile devices, control accessories like your on-board sound system, and choose from an array of built-in sonar features. Intuitive touch-screen controls bring easy operation with a design that smartphone and tablet users will find instantly familiar. Customize your home screen with the features you use most, and see everything you need on screen at once with adjustable split-screen views. Mark waypoints on charts with a touch, and easily assign meaningful names and symbols that make them quick to find when you are planning your next trip. C-MAP DISCOVER charts feature ultra-wide coverage in the US and Canada. DISCOVER charts include full-featured Vector Charts, Custom Depth Shading, Tides & Currents, and the very best of C-MAP high-resolution bathymetric contours, including integrated Genesis® data. Use C-MAP Easy Routing™ to make planning your next trip on the water as easy as planning a trip in the car, and always have the latest DISCOVER chart data with 12 months of free online updates. Built-in wireless connectivity mirrors your display to a compatible smartphone or tablet, giving you instant access to charts, radar, and other functionality from anywhere on board. Wireless also enables easy online software updates via an internet hotspot. NMEA 2000 connectivity offers a wide range of expansion and integration options: Monitor your boat's engine performance and fuel efficiency, steer your boat with a SIMRAD autopilot, or control your onboard entertainment system from your GO series display. Choose from a wide range of fish-finding sonar options to suit your vessel, from CHIRP or traditional sonar transducers for a classic fish-finder view, or get all your fish-finding sonar in a single transducer with Active Imaging Imaging 3-in-1. Active Imaging brings the world-class clarity and target separation of CHIRP Sonar, plus incredible detail of reefs, drop-offs, and wrecks from SideScan and DownScan Imaging™, giving you powerhouse performance every time you hit the water."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/200/master1_100935828_main?_a=AJAH1WI0",
      "title": "Simrad Cruise 7 Fishfinder/Chartplotter with US Coastal Map and 83/200 Transducer",
      "offer": false,
      "brand": "Simrad",
      "price": 569.99,
      "rating": 4,
      "description": "Easy to use, with intuitive features, the Simrad® Cruise 7 Fishfinder/Chartplotter with US Coastal Map and 83/200 Transducer offers full-function CHIRP sonar and GPS navigation to enhance every day on the water. Its 7 screen presents clear displays even in direct sunlight, with crisp 800x480-pixel resolution and selectable full- and split-screen views; the rotary dial and keypad controls allow effortless navigation through its array of menus, routes, and readings. The Cruise 7 comes pre-loaded with a C-MAP® US Coastal map and worldwide basemap, and accepts a wide range of enhanced mapping options. Includes 83/200 sonar transducer."
    }
  ],
  "gun_sub": [
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/3304741.json?$Prod_PLPThumb$",
      "title": "Beretta APX-A1 Carry Optics Ready Pistol",
      "offer": false,
      "brand": "Beretta",
      "price": 399.99,
      "rating": 4,
      "description": "The Beretta® APX-A1 Carry Optics Ready Pistol extends the proven APX lineup to a single-stacked, sub-compact size. The APX-A1 was designed with law enforcement and military in mind when needing an option for deep concealment while keeping the controls consistent with their larger counterparts. The APX features a removable serialized chassis, which allows you the option to switch grips without changing a serialized part. The low-bore axis is a plus in the APX for mitigating recoil. You'll receive front and rear cocking serrations, a reversible magazine catch, and a crisp trigger. The APX-A1 becomes an excellent choice for concealed carry."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/1400391.json?$Prod_PLPThumb$",
      "title": "Beretta 92FS Semi-Auto Pistol",
      "offer": true,
      "brand": "Beretta",
      "orig": "800",
      "price": 679.99,
      "rating": 2,
      "description": "Own one of the most extensively tested and duty-proven handgun designs in the world. The Beretta® 92FS Semi-Auto Pistol features a durable Bruniton™ non-reflective black finish for superior corrosion resistance. You can count on this double-action/single-action handgun for reliable shooting in a variety of scenarios. Checkered grip panels provide a positive, reliable grip, even with gloved hands. The Beretta 92FS utilizes a short recoil, delayed blowback system for enhanced control, while an open-top slide that virtually eliminates jams for superior reliability. The disassembly latch makes for easy, toolless fieldstripping, breaking the 92FS down into 4 main components for easy maintenance. A spring-loaded, ambidextrous safety lever doubles as a decocking lever, and a visible chamber indicator allows for visible and tactile chamber-status checks for an added layer of safety. A reversible magazine release accommodates right- and left-handed shooters, while two 15-round magazines ensure optimal firepower for defensive scenarios. Made in USA."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_101118921_main?_a=AJAH1WI0",
      "title": "Beretta 92X Performance Defensive Semi-Auto Pistol",
      "offer": false,
      "brand": "Beretta",
      "price": 1599.99,
      "rating": 4,
      "description": "Taking the iconic 92X Performance to the next level, the Beretta® 92X Performance Defensive Semi-Auto Pistol was designed with self-defense in mind. Aiming for top performance, the 92X Performance Defensive features a heavy Brigadier slide and a skeletonized hammer for reduced weight and improved balance. Sawtooth slide serrations on the front and rear offer effortless slide manipulation, even with gloved or wet hands for enhanced reliability on the go. The competition hammer spring and Extreme S-trigger mechanism deliver fast, precise follow-up shots. Plus, aggressive front strap and back strap checkering, in addition to an oversized hilt drastically improve handling for the best possible grip and control. Offering unrivaled performance and reliability, the Beretta 92X Performance is the ideal, best-in-class competition pistol."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_11118_main?_a=AJAH1WI0",
      "title": "Beretta 3032 Tomcat Inox Semi-Auto Pistol",
      "offer": false,
      "brand": "Beretta",
      "price": 599.99,
      "rating": 3,
      "description": "Looking to make an addition to the collection for the spy in your life? At the size of an average cell phone, the Beretta® 3032 Tomcat is designed for deep concealment, perfect for pocket carry and features a threaded barrel for the ultimate micro-concealed-carry hushpuppy. Chambered in .32 ACP, this ultra-reliable semi-auto pistol features a tip-up barrel for easy loading. You can load and insert the mag. Then, instead of racking the slide to chamber a round, you can use the barrel tip lever on the left side of the frame, which pops the barrel up, place your round in the chamber, then rotate the barrel back down. A great concept especially for those uncomfortable with racking and decocking. You can carry safety on, or off and decocked. The sights are low-profile but can still be used with the shoot-through-the-can method. This Beretta small-frame pistol features a snag-free design for easy draw and holstering, without sacrificing rear sight adjustability, making it a choice for concealed carry and self defense."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master2_101153798_main?_a=AJAH1WI0",
      "title": "Beretta 3032 Tomcat Semi-Auto Pistol",
      "offer": true,
      "brand": "Beretta",
      "orig": 700,
      "price": 599.99,
      "rating": 1,
      "description": "Looking to make an addition to the collection for the spy in your life? At the size of an average cell phone, the Beretta® 3032 Tomcat is designed for deep concealment, perfect for pocket carry and features a threaded barrel for the ultimate micro-concealed-carry hushpuppy. Chambered in .32 ACP, this ultra-reliable semi-auto pistol features a tip-up barrel for easy loading. You can load and insert the mag. Then, instead of racking the slide to chamber a round, you can use the barrel tip lever on the left side of the frame, which pops the barrel up, place your round in the chamber, then rotate the barrel back down. A great concept especially for those uncomfortable with racking and decocking. You can carry safety on, or off and decocked. The sights are low-profile but can still be used with the shoot-through-the-can method. This Beretta small-frame pistol features a snag-free design for easy draw and holstering, without sacrificing rear sight adjustability, making it a choice for concealed carry and self defense."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_10218338_main?_a=AJAH1WI0",
      "title": "Beretta PX4 Storm Semi-Auto Pistol",
      "offer": false,
      "brand": "Beretta",
      "price": 649.99,
      "rating": 2,
      "description": "Built around Beretta® PX4 modular technology, the Beretta PX4 Storm™ Semi-Auto Pistol delivers rapid shots with precise accuracy due to its ergonomic design and unique action. The PX4 utilizes a rotating barrel locking system that reduces felt recoil and muzzle rise by releasing recoil energy radially. The corrosion resistant fiberglass-reinforced polymer frame comes with 3 interchangeable backstraps to obtain a proper fit according to the individual shooter's hand. Non-slip texturing on the grip also aids in weapon control. An integral Picatinny rail provides rapid attachment of tactical lights and laser aiming devices. The PX4 Storm is a double/single action semi-automatic pistol with an external hammer. The ambidextrous safety doubles as a decocking lever. The slide features a Bruniton™ non-reflective black coating for superior corrosion and wear resistant finish, while forward and rear serrations provides a non-slip hold on the slide when loading and unloading the weapon. White, 3-dot sights provide quick sight acquisition in varied lighting. The gun's chrome-lined barrel resists corrosion and requires less maintenance. The Beretta PX4 Storm Semi-Auto Pistol fieldstrips quickly without tools into 5 subcomponents for cleaning and maintenance."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/flatdarkearth_101119007_main?_a=AJAH1WI0",
      "title": "Beretta M9A4 RDO Full-Size Semi-Auto Pistol",
      "offer": true,
      "brand": "Beretta",
      "orig": 1500,
      "price": 1099.99,
      "rating": 4,
      "description": "The Beretta® M9A4 RDO Full-Size DA/SA Semi-Auto Pistol represents the pinnacle of Beretta M9 pistols. The M9A4 is now optics ready and features dovetailed tritium night sights. The Xtreme Trigger System feels incredibly clean. The Beretta Vertec® frame feels consistent with a 1911 and points naturally. The thin Vertec grip panels allow a larger variety of hand sizes to get comfortable on the gun. The frame has an integrated Picatinny rail for a light or laser. Made in USA."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_101194221_main?_a=AJAH1WI0",
      "title": "Beretta APX-A1 Full-Size Optics-Ready Semi-Auto Pistol",
      "offer": false,
      "brand": "Beretta",
      "price": 399.99,
      "rating": 3,
      "description": "The next evolution in striker-fired handguns is here, and it's the Beretta APX-A1 Full-Size Optics-Ready Pistol. The APX-A1 was built around the original APX that passed MHS testing and now features a crisp trigger, enhanced ergonomics, more aggressive slide serrations, and is cut for an optic, right from the factory. The tritium front sight is easily acquired and pairs well with a serrated black rear sight. An ambidextrous slide release and reversible magazine release make this gun lefty friendly. The trigger guard undercut allows the shooter to obtain a lower bore axis, which gives you better control over recoil. Interchangeable backstraps allow the APX-A1 to better fit different hand shapes and sizes. Beretta brings quality to the table with this feature-rich, striker-fired pistol."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_100300822_main?_a=AJAH1WI0",
      "title": "Beretta 92X Performance Semi-Auto Pistol",
      "offer": true,
      "brand": "Beretta",
      "orig": 2000,
      "price": 1599.99,
      "rating": 1,
      "description": "Taking the iconic 92X Performance to the next level, the Beretta® 92X Performance Defensive Semi-Auto Pistol was designed with self-defense in mind. Aiming for top performance, the 92X Performance Defensive features a heavy Brigadier slide and a skeletonized hammer for reduced weight and improved balance. Sawtooth slide serrations on the front and rear offer effortless slide manipulation, even with gloved or wet hands for enhanced reliability on the go. The competition hammer spring and Extreme S-trigger mechanism deliver fast, precise follow-up shots. Plus, aggressive front strap and back strap checkering, in addition to an oversized hilt drastically improve handling for the best possible grip and control. Offering unrivaled performance and reliability, the Beretta 92X Performance is the ideal, best-in-class competition pistol."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_101327615_main?_a=AJAH1WI0",
      "title": "New! Beretta APX A1 Full-Size Semi-Auto Pistol with Burris Fastfire 3 Red Dot Sightl",
      "offer": false,
      "brand": "Beretta",
      "price": 549.99,
      "rating": 3,
      "description": "Check out the Beretta APX A1 Full-Size Semi-Auto Pistol with Burris® Fastfire™ 3 Red Dot Sight for an added bonus to turn up your shooting game. The APX A1 was built around the original APX that passed MHS testing and now features a crisp trigger, enhanced ergonomics, more aggressive slide serrations, and is cut for an optic, right from the factory. Picking up your target and aligning it with the Burris Fastfire 3 RDS makes for easier shooting, especially at distance. An ambidextrous slide release and reversible magazine release make this gun lefty friendly. The trigger guard undercut allows the shooter to obtain a lower bore axis, which gives you better control over recoil. Interchangeable backstraps allow the APX A1 to better fit different hand shapes and sizes. Beretta brings quality to the table with this feature-rich, striker-fired pistol."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/flatdarkearth_101119021_main?_a=ATO2BAA0",
      "title": "Beretta M9A4 Centurion Compact Semi-Auto Pistol",
      "offer": true,
      "brand": "Beretta",
      "orig": 2100,
      "price": 1099.99,
      "rating": 2,
      "description": "The Beretta® M9A4 RDO Full-Size DA/SA Semi-Auto Pistol represents the pinnacle of Beretta M9 pistols. The M9A4 is now optics ready and features dovetailed tritium night sights. The Xtreme Trigger System feels incredibly clean. The Beretta Vertec® frame feels consistent with a 1911 and points naturally. The thin Vertec grip panels allow a larger variety of hand sizes to get comfortable on the gun. The frame has an integrated Picatinny rail for a light or laser. Made in USA."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_100376022_main?_a=AJAH1WI0",
      "title": "Bond Arms Roughneck Derringer",
      "offer": false,
      "brand": "Bond Arms",
      "price": 269.99,
      "rating": 4,
      "description": "The compact Bond Arms® Roughneck Derringer represents the modern incarnation of the concealed-carry classic. Compatible with all standard Bond Arms interchangeable barrels, this model comes equipped with a patented rebounding hammer, retracting firing pins, and frame and double barrel crafted from stainless steel. Other highlights of the Bond Arms Roughneck Derringer include cross-bolt safety; spring-loaded, cammed locking lever; synthetic black rubber grip; and front blade and fixed rear sight. Smoothed lined holsters recommended for carry."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_190458_main?_a=AJAH1WI0",
      "title": "Browning Black Label Medallion Pro 1911-380 Semi-Auto Pistol",
      "offer": true,
      "brand": "Browning",
      "orig": 1000,
      "price": 829.99,
      "rating": 2,
      "description": "The Browning® Black Label® Medallion® Pro 1911-380 Semi-Auto Pistol is a scaled down version of the John M. Browning designed M1911. The Black Label Pro is 85 percent the size of a Model 1911 in .45 ACP, making it a more compact pistol for concealed carry, yet the grip is long and wide enough to allow much greater shooting control than is offered by smaller .380 ACP pistols. Similar to a full-size 1911, the Browning 1911-380 operates with a locked-breech recoil-operated system, which uses a much lighter recoil spring than the blowback-operated 380 pistols, making manual operation of the slide easy. The 1911-380 is constructed with a composite mainframe, with machined 7075 aluminum sub-frame and slide rails. The Black Label Medallion Pro comes with steel 3-dot combat sights dovetailed to the receiver, as well as checkered rosewood grip panels. The stainless steel slide is finished with a blackened top and silver brushed polished flats. The grip features a flared beavertail grip safety with a checkered and raised memory bump. The flat mainspring housing has a non-aggressive textured pattern to aid in providing a sure grip. The extended ambidextrous thumb safety is easy to reach and intuitive to operate with either hand. Disassembly of the Black Label Medallion Pro 1911-380 Semi-Auto Pistol is also similar to a full-size 1911. Comes with two 8-round, heat-treated steel magazines and a black ABS gun case."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_15022007572643_main?_a=AJAH1WI0",
      "title": "Browning Black Label 1911-380 Semi-Auto Pistol",
      "offer": false,
      "brand": "Browning",
      "price": 699.99,
      "rating": 3,
      "description": "The Browning® Black Label® 1911-380 Semi-Auto Pistol is a scaled down version of the John M. Browning designed M1911. The Black Label 1911-380 is 85 percent the size of a Model 1911 in .45 ACP, making it a more compact pistol for concealed carry, yet the grip is long and wide enough to allow much greater shooting control than is offered by smaller .380 ACP pistols. Similar to a full-size 1911, the Browning 1911-380 operates with a locked-breech recoil-operated system, which uses a much-lighter recoil spring than blowback-operated 380 pistols, making manual operation of the slide easy. Disassembly of the 1911-380 is also similar to a full-size 1911. The Black Label 1911-380 is constructed with a composite mainframe, with separate grip panels, and a matte black finished steel slide. The grip features a flared beavertail grip safety with a checkered and raised memory bump. The flat mainspring housing has a non-aggressive textured pattern to aid in providing a sure grip. The extended ambidextrous thumb safety is easy to reach and intuitive to operate with either hand. Low-profile combat sights minimize the risk of snagging when drawing the pistol and provide rapid sight acquisition. The Browning Black Label 1911-380 Semi-Auto Pistol is a thin, compact concealed carry pistol, just large enough to be user friendly and easy to hit targets with. Comes with 1 8-round, heat-treated steel magazine and a black ABS gun case."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/4769569.json?$Prod_PLPThumb$",
      "title": "Canik TP9SFX Semi-Auto Pistol with Full Accessory Pack",
      "offer": false,
      "brand": "Canik",
      "price": 499.99,
      "rating": 1,
      "description": "The Canik TP9SFX Semi-Auto Pistol with Full Accessory Pack gets you all the heat at a shocking value. Canik offers some of the most popular custom modifications on pistols direct from the factory in this awesome package. You'll notice the frame starting off with an ergonomic grip, interchangeable backstraps, improved single-action trigger, an adjustable-length reversible magazine catch, an integral accessory rail for adding a light or laser, and an extended slide stop. On the slide, the TP9SFX is topped off with front and rear cocking serrations, an optics-ready slide, lightening-cut slide, Warren Tactical fiber-optic front sight, match grade barrel, and a striker status indicator. In the case, you'll receive 2 magazines, 4 mounting plates, a polymer holster with belt/paddle adjustment, a cleaning rod, and brush."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_100367367_main?_a=AJAH1WI0",
      "title": "Canik TP9 Elite Striker Fired Pistol with Warren Tactical Sights",
      "offer": true,
      "brand": "Canik",
      "orig": 700,
      "price": 399.99,
      "rating": 3,
      "description": "Carry with confidence with the Canik TP9 Elite Striker Fired Pistol with Warren Tactical Sights. Finish resists corrosion for long-lasting performance. Reliable striker fired action. Textured polymer grips provide a nonslip grip from drawing to holstering. Warren tactical 3-dot sights help you stay on target, while a cutout on the slide accommodates an optional micro-optic (not included). This concealed carry pistol also includes 2 magazines, and an IWB/OWB holster."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/blackcerakote1_100850188_main?_a=AJAH1WI0",
      "title": "New! CANIK TP9SF Semi-Auto Pistol",
      "offer": false,
      "brand": "Canik",
      "price": 379.99,
      "rating": 4,
      "description": "The CANIK TP9SF Semi-Auto Pistol is a striker-fired pistol, designed to meet and exceed law-enforcement and military standards. Featuring Warren® tactical sights for rapid, intuitive target acquisition, and a short reset trigger with nickel-plated action components, this handgun excels in rapid-fire scenarios, and withstands heat, water, dirt, and sand for dependable performance. The match-grade barrel features a durable nitride finish, and the slide boasts a Cerakote® finish for superior corrosion resistance, while a loaded-chamber indicator and striker status indicator offers enhanced visual safety. The reversible magazine catch and ambidextrous slide release allows both right- and left-handed shooters to handle the weapon with ease, while an accessory rail readily accepts a variety of lights and laser sights for enhanced versatility. Offering superior durability and reliability, the CANIK TP9SF pistol is ideal for military, law enforcement, and civilian shooters alike."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/black_100847346_main?_a=AJAH1WI0",
      "title": "CANIK TP9SA Mod.2 Semi-Auto Pistol",
      "offer": true,
      "brand": "Canik",
      "orig": 500,
      "price": 349.99,
      "rating": 3,
      "description": "The CANIK® TP9SA Mod.2 Semi-Auto Pistol is a feature-rich single-action pistol, boasting comfortable ergonomics and ambidextrous controls. Featuring Warren® tactical sights for rapid, intuitive target acquisition, and a short reset, single-action trigger, this handgun excels in rapid fire scenarios, and withstands heat, water, dirt, and sand for dependable performance. The stainless steel, match-grade barrel and slide feature a durable Nitride finish for superior corrosion resistance, while a loaded chamber indicator and striker status indicator offers enhanced visual safety. The reversible magazine release allows both right- and left-handed shooters to handle the weapon with ease, while an accessory rail readily accepts a variety of lights and laser sights for enhanced versatility."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_101195810_main?_a=AJAH1WI0",
      "title": "Canik METE SFx Semi-Auto Pistol",
      "offer": false,
      "brand": "Canik",
      "price": 524.99,
      "rating": 4,
      "description": "The Canik METE SFx Semi-Auto Pistol is loaded with high performance at a shocking value. Canik offers some of the most popular custom modifications on pistols direct from the factory in this awesome package. You'll notice the frame starting off with an ergonomic grip, interchangeable backstraps, redesigned beavertail, flared internal magwell, improved single-action trigger, an adjustable-length reversible magazine catch, an integral accessory rail for adding a light or laser, and an extended slide stop. On the slide, the METE SFx is topped off with front and rear cocking serrations, an optics-ready slide, lightening-cut slide, 3-dot white sights, and a striker status indicator. In the case, you'll receive one 20-round magazine, one 18-round magazine, 2 red dot mounting plates, a polymer holster with belt/paddle adjustment, a cleaning rod, and brush."
    },
    {
      "img": "https://assets.basspro.com/image/list/fn_select:jq:first(.%5B%5D%7Cselect(.public_id%20%7C%20endswith(%22main%22)))/2996369.json?$Prod_PLPThumb$",
      "title": "Charles Daly 1911 Field-Grade Semi-Auto Pistol",
      "offer": false,
      "brand": "Charles Daly",
      "price": 449.99,
      "rating": 2,
      "description": "Charles Daly 1911 Field-Grade Semi-Auto Pistol aims to please the handgun shooter who values high-end, Italian-made quality priced for maximum affordability. Crafted from steel with distinguishing walnut grips, this single-trigger pistol features a 5 barrel. Other details include integrated grip safety and auto-eject extraction. The Charles Daly 1911 Field-Grade semi-auto pistol includes 1 magazine."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_14042303013418_main?_a=AJAH1WI0",
      "title": "Charter Arms Undercoverette Double-Action Revolver",
      "offer": true,
      "brand": "Charter Arms",
      "orig": 600,
      "price": 389.99,
      "rating": 1,
      "description": "The Undercoverette double-action revolver from Charter Arms® is based on the popular Undercover model, though chambered in the sizzling .32 H&R magnum cartridge. The frame, barrel, cylinder, and working parts are made of stainless steel to prevent corrosion from deep concealed carry. The Undercoverette shoots quickly in double-action, or you can cock it with the traditional spur hammer and take a cool aim. The fixed sights interfere minimally when drawing the double-action revolver from a concealed position, and rubber grips provide a solid hold while absorbing recoil."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_13050210164814_main?_a=AJAH1WI0",
      "title": "Charter Arms Lavender Lady Double-Action Revolver",
      "offer": false,
      "brand": "Charter Arms",
      "price": 449.99,
      "rating": 3,
      "description": "The Lavender Lady is a duotone double-action revolver from Charter Arms®, based on the popular Undercover Lite™ model. The tough, aircraft-grade aluminum frame is anodized with an attractive lavender finish; the cylinder, barrel, and working parts are made of stainless steel. Incredibly lightweight, this revolver makes it an ideal concealed carry weapon. The Lavender Lady shoots quickly in double-action, or you can cock it with the traditional spur hammer and take a cool aim. The fixed sights interfere minimally when drawing the double-action revolver from a concealed position, and rubber grips provide a solid hold, while absorbing recoil."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_1405010711358_main?_a=AJAH1WI0",
      "title": "Charter Arms Chic Lady Double-Action Revolver",
      "offer": true,
      "brand": "Charter Arms",
      "orig": 820,
      "price": 429.99,
      "rating": 2,
      "description": "The Chic Lady® is a duotone double-action revolver from Charter Arms®, based on the popular Undercover Lite™ model. The tough, aircraft-grade aluminum frame is anodized with an attractive pink finish; the cylinder and barrel are made of high-polished stainless steel. Incredibly lightweight, this revolver makes an ideal concealed carry weapon. The Chic Lady shoots quickly in double-action, or you can cock it with the traditional spur hammer and take a cool aim. The fixed sights interfere minimally when drawing the double-action revolver from a concealed position, and rubber grips provide a solid hold while absorbing recoil."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_10672_main?_a=AJAH1WI0",
      "title": "New! Charter Arms Undercover Lite Double-Action Revolver",
      "offer": false,
      "brand": "Charter Arms",
      "price": 419.99,
      "rating": 4,
      "description": "The Undercover Lite® Double-Action Revolver from Charter Arms® is constructed with a tough aluminum frame and a stainless steel cylinder and barrel. Incredibly lightweight and corrosion–resistant, this revolver makes it an ideal concealed-carry weapon. The Undercover Lite shoots quickly in double-action, or you can cock it with the traditional spur hammer and take a cool aim. The fixed sights interfere minimally when drawing the double-action revolver from a concealed position, and rubber grips provide a solid hold, while absorbing recoil."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_100245919_main?_a=AJAH1WI0",
      "title": "Colt King Cobra Revolver",
      "offer": false,
      "brand": "Colt",
      "price": 999.99,
      "rating": 3,
      "description": "Colt® introduced the Cobra revolver in 2017, and now, Colt is ready to unveil its bigger, more-powerful brother – the King Cobra™ Revolver. Built like a cannon, this double-action, 6-shot, .357 Magnum model sports a heavy-duty frame with brushed stainless steel construction. Its 3 barrel offers a brass bead front sight for split-second target acquisitions. Hogue overmolded grips deliver comfort and a secure grasp. As you can expect, the Colt King Cobra Revolver weighs in at a hefty 1.75 lbs."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_101037464_main?_a=AJAH1WI0",
      "title": "Colt Anaconda Double/Single Revolver",
      "offer": false,
      "brand": "Colt",
      "price": 1499.99,
      "rating": 4,
      "description": "The Colt® Anaconda Double/Single Revolver has been fully re-designed to utilize an oversized Python® action. Bulked-up with a solid stainless steel frame for strength and durability, this DA revolver is worthy of its pedigree. Experience the Linear Leaf Spring Action for a non-stacking, smooth-as-glass trigger pull. With recoil-absorbing Hogue grips and adjustable, interchangeable sights, this .44 Magnum is cool and comfortable from the range to the woods. The lengthy barrel of this Colt revolver features bore rifling for pin-point accuracy. Hogue® synthetic, overmolded, and ergonomic grips add firm control and recoil-absorbing comfort. A recessed target crown offers protection and the frame is drilled and tapped for optics mounts, making the Anaconda an unstoppable huntsman's sidearm."
    },
    {
      "img": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_220/v1/ProductImages/450/master1_100262829_main?_a=AJAH1WI0",
      "title": "Davide Pedersoli Howdah Pistol",
      "offer": false,
      "brand": "Davide Pedersoli",
      "price": 1899.99,
      "rating": 3,
      "description": "A true-to-spec reproduction of the famous pistol produced by the Ithaca Company in 1920, the Davide Pedersoli® Howdah Pistol is a beautiful – and slightly unusual – pistol, great for any collection. Sporting a color case-hardened action and a handsome, oil finished walnut stock, this iconic pistol features rifled barrels and a .45 Long Colt and .410 Bore chamber, allowing you to shoot either round interchangeably. An automatic safety and dual extractors ensure safe, reliable performance, while the blued, 10 stainless steel barrel boasts a 1:35 twist ratio for optimal accuracy."
    }
  ]
}
